//
//  SelectCollectionViewModel.swift
//  ShowMustGoOn
//
//  Created by 김지훈 on 1/28/25.
//

import UIKit

class SelectCollectionViewModel {
    var ingredients: SelectCollectionModel =  SelectCollectionModel(menuTitle: [
        "애호박", "감자", "당근", "무", "양파", "대파", "청양고추", "깻잎", "부추", "아보카도", "표고버섯", "마늘쫑", "양배추", "마늘", "콩나물", "쪽파", "청경채",
        "양송이버섯", "새송이버섯", "꽈리고추", "오이", "고구마", "냉이", "취나물", "참나물", "양상추", "알배추", "아스파라거스", "숙주", "시금치", "가지", "머위",
        "팽이버섯", "느타리버섯", "피망", "국거리(소)", "다짐육", "닭(백숙용)", "닭(볶음탕용)", "닭가슴살", "닭안심살", "대패삼겹", "돼지갈비", "목살", "베이컨",
        "앞다리살", "찌개고기", "차돌박이", "카레고기", "햄", "항정살", "꽁치", "오징어", "어묵", "고등어", "진미채", "쭈꾸미", "낙지", "새우", "참치", "골뱅이",
        "연어", "두부", "순두부", "계란", "메추리알", "검은콩", "소면", "파스타면", "떡국 떡", "떡볶이 떡", "쌀국수", "메밀국수", "우동면", "라면사리", "미역",
        "건새우", "미역줄기", "우유", "슬라이스치즈", "슈레드치즈", "버터", "방울토마토", "토마토", "토마토소스", "냉면육수", "빵", "김밥 김", "마카로니", "밥", "밀가루",
        "김가루", "찹쌀", "도토리묵", "순대",
    ])
    
    //선택한 셀
    var selectIndexPath: [IndexPath] = []
    
    //선택한 재료 배열
    var selectIngredient: [String] = []
}
